#### Import Libraries

In [1]:
import numpy as np
import pandas as pd

#### Ex.3.1 Create a dictionary to combine four Series from the four columns in the following table：
|&nbsp;|   name     | age | gender | height |
|-|:----------:|:---:|:------:|:------:|
|0| Emma       |  21 | Female |  163   |
|1| Tommy      |  26 |  Male  |  177   |
|2| Mike       |  23 |  Male  |  154   |
|3| Steven     |  28 |  Male  |  168   |
|4| Emily      |  25 | Female |  160   |
|5| Gloria     |  23 | Female |  166   |

In [2]:
# code for Ex.3.1
dictionary = {
                  'name'       : pd.Series(['Emma', 'Tommy', 'Mike', 'Steven', 'Emily', 'Gloria']),
                  'age'        : pd.Series([21, 26, 23, 28, 25, 23]), 
                  'gender'     : pd.Series(['Female', 'Male', 'Male', 'Male', 'Female', 'Female']),
                  'height'     : pd.Series([163, 177, 154, 168, 160, 166])
             }
print(dictionary)

{'name': 0      Emma
1     Tommy
2      Mike
3    Steven
4     Emily
5    Gloria
dtype: object, 'age': 0    21
1    26
2    23
3    28
4    25
5    23
dtype: int64, 'gender': 0    Female
1      Male
2      Male
3      Male
4    Female
5    Female
dtype: object, 'height': 0    163
1    177
2    154
3    168
4    160
5    166
dtype: int64}

#### Ex.3.2 Create a DataFrame the same to the table in Ex.3.1 from a dictionary of Series：

In [3]:
# code for Ex.3.2

df = pd.DataFrame(dictionary)

In [4]:
# (optional) rearrange the order of columns (default order of columns follows the order of alphabet)

df = df[df.columns.sort_values()]
df

   age  gender  height    name
0   21  Female     163    Emma
1   26    Male     177   Tommy
2   23    Male     154    Mike
3   28    Male     168  Steven
4   25  Female     160   Emily
5   23  Female     166  Gloria

#### Ex.3.3 Pick out all the male items and assign them to a new DataFrame df_male

In [5]:
# code for Ex.3.3

df_male = df[df.gender=='Male']
df_male

   age gender  height    name
1   26   Male     177   Tommy
2   23   Male     154    Mike
3   28   Male     168  Steven

#### Ex.3.4 Check the average age and average height of these six students

In [6]:
# code for Ex.3.4

df.mean()

age        24.333333
height    164.666667
dtype: float64

#### Ex.3.5 Is there any relationship between height and age?

In [7]:
# code for Ex.3.5

df.corr()

             age    height
age     1.000000  0.488935
height  0.488935  1.000000